# Библиотека тафсиров — Tafsir Library

## Документация
- **[HELP.md](HELP.md)** — руководство пользователя (режимы, ⚙ Вид, навигация, теги).
- **[GUIDE.md](GUIDE.md)** — для мейнтейнера: формат данных, добавление тафсиров,
  **разметка Markdown**, пословный словарь/иъраб, шрифты/мусхаф, публикация.
- **[CHANGELOG.md](CHANGELOG.md)** — история изменений.

## Быстрый старт

1. Откройте `index.html` в браузере (Chrome, Firefox, Edge)
2. Если файл открыт локально (file://), браузер может заблокировать загрузку JSON.
   В этом случае запустите локальный сервер (см. ниже).

### Запуск локального сервера (самый простой способ)

Откройте терминал/командную строку в папке проекта и выполните одну из команд:

**Python 3** (обычно уже установлен на Mac/Linux):
```
python3 -m http.server 8000
```

**Python 2**:
```
python -m SimpleHTTPServer 8000
```

**Node.js**:
```
npx serve .
```

Затем откройте в браузере: http://localhost:8000

### Размещение онлайн

Просто загрузите всю папку на любой хостинг статических файлов:
- **GitHub Pages** (бесплатно) — создайте репозиторий, загрузите файлы, включите Pages
- **Netlify** (бесплатно) — перетащите папку на netlify.com/drop
- **Vercel** (бесплатно) — аналогично

---

## Структура проекта

```
tafsir-library/
├── index.html              ← Само приложение
├── README.md               ← Эта инструкция
└── data/
    ├── config.json          ← Список тафсиров и групп
    └── tafsirs/
        ├── tabari.json      ← Файл тафсира ат-Табари
        ├── kathir.json      ← Файл тафсира Ибн Касир
        ├── qurtubi.json     ← ...
        ├── baghawi.json
        ├── saadi.json
        ├── saadi_ru.json
        └── kuliev.json
```

---

## Как добавить новый тафсир

### Шаг 1. Создайте JSON-файл тафсира

Создайте файл в папке `data/tafsirs/`, например `muyassar.json`.

Формат файла:

```json
{
  "1": {
    "1": "Текст тафсира для суры 1, аята 1",
    "2": "Текст тафсира для суры 1, аята 2",
    "3": "Текст тафсира для суры 1, аята 3"
  },
  "2": {
    "1": "Текст тафсира для суры 2, аята 1",
    "2": "Текст тафсира для суры 2, аята 2"
  },
  "112": {
    "1": "Текст тафсира для суры 112, аята 1",
    "2": "...",
    "3": "...",
    "4": "..."
  }
}
```

Первый уровень ключей — номер суры, второй — номер аята, значение — текст тафсира.

### Шаг 2. Зарегистрируйте тафсир в config.json

Откройте `data/config.json` и добавьте запись в массив `"tafsirs"`:

```json
{
  "id": "muyassar",
  "file": "tafsirs/muyassar.json",
  "name": "Тафсир Муяссар",
  "nameAr": "التفسير الميسر",
  "author": "Группа учёных",
  "authorAr": "مجمع الملك فهد",
  "group": "modern_ar",
  "lang": "ar",
  "year": ""
}
```

Поля:
- `id` — уникальный идентификатор (латиницей, без пробелов)
- `file` — путь к JSON-файлу относительно папки `data/`
- `name` — название на русском (или другом языке интерфейса)
- `nameAr` — название на арабском
- `author` — автор / переводчик
- `group` — id группы из массива `groups` (см. ниже)
- `lang` — язык текста: `"ar"` для арабского (включает RTL), `"ru"` для русского
- `year` — год (необязательно)

### Шаг 3. (При необходимости) Добавьте новую группу

Если нужна новая категория, добавьте в массив `"groups"`:

```json
{
  "id": "turkish",
  "name": "Тафсиры на турецком",
  "nameAr": "التفاسير التركية",
  "icon": "🇹🇷"
}
```

---

## Как подготовить JSON из текстового файла

Если у вас тафсир в виде текстового файла, используйте скрипт-конвертер.

### Формат входного текста

Каждый фрагмент тафсира начинается с метки `### сура:аят`, за которой следует текст:

```
### 1:1
Текст тафсира к аяту 1 суры 1.
Может быть многострочным.

### 1:2
Текст тафсира к аяту 2 суры 1.
Тоже может быть многострочным.
```

### Скрипт конвертации (Python)

Сохраните как `convert.py` и запустите: `python3 convert.py input.txt output.json`

```python
import json, sys, re

def convert(input_path, output_path):
    with open(input_path, 'r', encoding='utf-8') as f:
        text = f.read()

    data = {}
    parts = re.split(r'^### (\d+):(\d+)\s*$', text, flags=re.MULTILINE)

    i = 1
    while i < len(parts) - 2:
        surah = parts[i]
        ayah = parts[i+1]
        content = parts[i+2].strip()
        if surah not in data:
            data[surah] = {}
        data[surah][ayah] = content
        i += 3

    with open(output_path, 'w', encoding='utf-8') as f:
        json.dump(data, f, ensure_ascii=False, indent=2)

    print(f"Готово: {len(data)} сур")

if __name__ == "__main__":
    convert(sys.argv[1], sys.argv[2])
```

---

## Масштабирование

Приложение загружает тафсир только когда пользователь его выбирает. 
Поэтому можно хранить сотни и тысячи файлов — при открытии страницы 
загружается только config.json (список тафсиров), а тексты подгружаются по одному.

Рекомендации:
- Один тафсир = один JSON-файл (до 20-30 МБ без проблем)
- Если тафсир очень большой (например, ат-Табари — 30 томов), 
  можно разбить по сурам: `tabari_001.json`, `tabari_002.json` и т.д.
  (потребует небольшой доработки кода)
- Для 1000+ тафсиров config.json будет около 200 КБ — это нормально

---

## Редактирование

Для редактирования JSON-файлов рекомендуется использовать:

- **VS Code** (бесплатный) — подсветка синтаксиса, проверка ошибок, удобная навигация
- **Notepad++** (Windows, бесплатный) — лёгкий и быстрый
- Любой текстовый редактор с поддержкой UTF-8

НЕ используйте: Word, FrontPage, KompoZer — они для вёрстки HTML, а не для данных.
